//Написати функцію min зі змінною кількістю параметрів, що знаходить мінімальне із чисел типу int або із чисел типу double,
//тип параметрів визначається за допомогою першого параметра функції. Написати викликаючу функцію main, що звертається до функції
//min не менше трьох разів з кількістю параметрів 5, 10, 12.
#include <stdio.h>
#include <stdarg.h>

int min(int k, ...)
{
    va_list ap;
    va_start(ap, k);
    int min1 = k;
    int l;

    for(;k>0;k--)
    {
         l = va_arg(ap, int);
         if( l < min1)
           min1=l;
    }

    va_end(ap);

    return min1;
}
int main()
{
    printf("min of {-12,133, 0, 6, 1} is: %d \n", min(5,-12,133, 0, 6, 1));
    printf("min of {0, -100, 23, 77, -2000, 0, 123, 4, 5, 13} is: %d \n", min(10, 0, -100, 23, 77, -2000, 0, 123, 4, 5, 13));
    printf("min of {1, 2, 3, 4, 5, 7, -1, -3, -4 , -6, -2, 0} is: %d \n", min(12, 1, 2, 3, 4, 5, 7, -1, -3, -4 , -6, -2, 0));
    return 0;
}
